//---------------------------------------------------------------------------
//--Переменные необходимые для обмена по RS-485--//
//---------------------------------------------------------------------------
#include <vcl.h>
//---------------------------------------------------------------------------
	extern TFormMain *FormMain;

	unsigned char
	// количество ошибок связи подряд и предельного количества ошибок связи
	errD925 = 0, maxErrD925 = 5,
	errD972 = 0, maxErrD972 = 5,
	errSS10 = 0, maxErrSS10  = 5,
	err7017 = 0, maxErr7017  = 5;
	
	// необъектные функции
	int D925 ( unsigned int SH ); // функция связи с 925
	int D972 ( unsigned int SH ); // функция связи с 972
	int SS_10 ( unsigned int SH ); // функция связи с СС-10
	int I7017 ( unsigned int SH ); // функция связи с I7017
	// вспомогательные
	void com3_PackageClear ();		// очистка массивов обмена
	AnsiString AnswerToAnsiString ( unsigned char ); // выделение строки из посылки