#ifndef pci1784H
#define pci1784H
//---------------------------------------------------------------------------
//--Переменные и функции PCI-1784--//
//---------------------------------------------------------------------------
#include "drivers\DAQHeader.h"
#include "drivers\bdaqctrl.h"
using namespace Automation::BDaq;
//---------------------------------------------------------------------------
#define deviceDescription L"PCI-1784,BID#4"
#define COUNT_NUMBER 4
//---------------------------------------------------------------------------
    UdCounterCtrl * Counter1784[COUNT_NUMBER];
//---------------------------------------------------------------------------
void
    OpenPCI1784();           // инициализировать PCI-1784

void
    SetChannel1_0(),        // выставить счетчик ФРП канала 1 в ноль
    SetChannel2_0(),        // выставить счетчик ФРП канала 2 в ноль
    SetChannel3_0(),        // выставить счетчик ФРП канала 3 в ноль
	SetChannel4_0(),        // выставить счетчик ФРП канала 4 в ноль
    ClosePCI1784();          // закрыть PCI-1784

int
    GetChannel1();          // считать показания ФРП канала 1
    GetChannel2(),          // считать показания ФРП канала 2
    GetChannel3(),          // считать показания ФРП канала 3
	GetChannel4();          // считать показания ФРП канала 4
//---------------------------------------------------------------------------
#endif
